{
  "version": "https://jsonfeed.org/version/1",
  "title": "Xenophanes Musings",
  "home_page_url": "http://localhost:1313/",
  "feed_url": "http://localhost:1313/feed.json",
  "description": "A minimal hugo theme focus on content",
  "favicon": "http://localhost:1313//assets/favicon.ico",
  "expired": false,
  "author": {
    "name": "Calvin Tran",
    "url": "http://localhost:1313/"
  },
  "items": [
    
    

    
    {
      "id": "b7c79b7baf65233a4adaabec8486f30fb5866a10",
      "title": "New Beginning",
      "summary": "",
      "content_text": "Beginning of Xenophanes musings I am restarting my old way of blogging with more quantity, with the right quality efforts. i have decided to move all my writings from my beehiiv newsletter to a personal blogging site.\nMy journey of writing: Looking back, I started to write from the year 2020 with Hugo static site generator hosted in Netlify. https://pwnl0rd.netlify.app/ I was not a consistent writer back then and i used to tinker with computer systems. Now i am a theorist, i think before i do, i ask questions against the assumptions that are held. As a habit, i read books for 30 mins daily and i write connecting between security and the book i read. From late 2023, i consistently started to write one blog post per month. Now, I want to do more. I have decided to write more and write when i want to write.\nRunning a newsletter Writing a newsletter is different from writing a blog. I do not have a good experience with Substack because Substack will block you if anyone reports you as spam. Then i migrated to beehiiv (https://ram.beehiiv.com/). Substack had good distribution provided by the platform but was controlled, whereas beehiiv does not have good distribution so i have to distribute by myself. In the newsletter, by default readers think that the writer expects them to subscribe. This makes them judge who am i rather than what i write. I do not care about me at all, who am i. I care about my writings and the expectations to be read by people. I do not want to write for the sake of free subs which does not do any good to me. I want to entirely let go of this newsletter way of blogging and come to a simple blog. If anyone wants to follow my blogs, they could by following the RSS feed and not by force or begging to follow mine cause their time is precious. There are so many writings, blog posts already there. I do not want to create noise. Rather, i will use this blog post to write what all i think and be a better writer rather than a salesman convincing people to subscribe to it. Another reason would be that readers are distracted in the newsletter by popups, fancy pages and it forces me to write in a style which i do not want to do.\nTo run a newsletter, I should either write for a market/readers who are looking for my next post. Personally, i do not want to run a newsletter cause it is noise rather than signal or i need user subscriptions such that in the future they are going to help me by monetizing it.\nTo run a newsletter, you need to write a post per week to keep the users on the hook. i did try weekly reads, a curated list of links in product security. i did it for a few weeks and then the question i had is, should i change my newsletter to weekly reads. That does not quench my satisfaction. I do not want to treat my writings as a newsletter cause i am a blogger.\nIf you could ask me about the best blogs/writings, i would say Irrational Exuberance, Manas J Saloi blogs. These are golden writings and journal-style blogging. I liked journal blogs. It is transparent, honest, no gimmicks of solutioning, it is what it is. I believe most of the newsletters i read in cybersecurity are just solutioning. They do not talk about the problem and how to view the problem firstly. They start to write focusing on solving rather than talking well about the problem. You could ask the question: should you have done blogging instead of a newsletter? I know—to differentiate the way newsletters work and blogging works took time for me to understand. I thought why not blog in a newsletter way and you get a bunch of subscribers. Rather, it made me write what i do not want to write. The dashboard of the newsletter shows the subscription trends, who is reading. This metric is changing the way i write. Rather than focusing on my writing, i just focus on what i could say to convince users to subscribe. Is this what i want? no. Hence i decided to move to blogging site than newsletter.\nBlog Name Inspiration Xenophane is a Greek philosopher who was the pioneer of first principle thinking. At the time of religion taking its peak, Xenophane thought about the clouds and rain from a non-religious base. In those times, religion was the answer for anything that is on earth. My blog writings will be based on first principles, questioning the assumptions that the theories are formed from.\nXenophanes musings is a blog that captures the thoughts of a Xenophaner (any person who thinks from first principles).\n",
      "content_html": "\u003ch1 id=\"beginning-of-xenophanes-musings\"\u003eBeginning of Xenophanes musings\u003c/h1\u003e\n\u003cp\u003eI am restarting my old way of blogging with more quantity, with the right quality efforts. i have decided to move all my writings from my beehiiv newsletter to a personal blogging site.\u003c/p\u003e\n\u003ch2 id=\"my-journey-of-writing\"\u003eMy journey of writing:\u003c/h2\u003e\n\u003cp\u003eLooking back, I started to write from the year 2020 with Hugo static site generator hosted in Netlify. \u003ca href=\"https://pwnl0rd.netlify.app/\"\u003ehttps://pwnl0rd.netlify.app/\u003c/a\u003e I was not a consistent writer back then and i used to tinker with computer systems. Now i am a theorist, i think before i do, i ask questions against the assumptions that are held. As a habit, i read books for 30 mins daily and i write connecting between security and the book i read. From late 2023, i consistently started to write one blog post per month. Now, I want to do more. I have decided to write more and write when i want to write.\u003c/p\u003e\n\u003ch2 id=\"running-a-newsletter\"\u003eRunning a newsletter\u003c/h2\u003e\n\u003cp\u003eWriting a newsletter is different from writing a blog. I do not have a good experience with Substack because Substack will block you if anyone reports you as spam. Then i migrated to beehiiv (\u003ca href=\"https://ram.beehiiv.com/)\"\u003ehttps://ram.beehiiv.com/)\u003c/a\u003e. Substack had good distribution provided by the platform but was controlled, whereas beehiiv does not have good distribution so i have to distribute by myself. In the newsletter, by default readers think that the writer expects them to subscribe. This makes them judge who am i rather than what i write. I do not care about me at all, who am i. I care about my writings and the expectations to be read by people. I do not want to write for the sake of free subs which does not do any good to me. I want to entirely let go of this newsletter way of blogging and come to a simple blog. If anyone wants to follow my blogs, they could by following the RSS feed and not by force or begging to follow mine cause their time is precious. There are so many writings, blog posts already there. I do not want to create noise. Rather, i will use this blog post to write what all i think and be a better writer rather than a salesman convincing people to subscribe to it. Another reason would be that readers are distracted in the newsletter by popups, fancy pages and it forces me to write in a style which i do not want to do.\u003c/p\u003e\n\u003cp\u003eTo run a newsletter, I should either write for a market/readers who are looking for my next post. Personally, i do not want to run a newsletter cause it is noise rather than signal or i need user subscriptions such that in the future they are going to help me by monetizing it.\u003c/p\u003e\n\u003cp\u003eTo run a newsletter, you need to write a post per week to keep the users on the hook. i did try weekly reads, a curated list of links in product security. i did it for a few weeks and then the question i had is, should i change my newsletter to weekly reads. That does not quench my satisfaction. I do not want to treat my writings as a newsletter cause i am a blogger.\u003c/p\u003e\n\u003cp\u003eIf you could ask me about the best blogs/writings, i would say Irrational Exuberance, Manas J Saloi blogs. These are golden writings and journal-style blogging. I liked journal blogs. It is transparent, honest, no gimmicks of solutioning, it is what it is. I believe most of the newsletters i read in cybersecurity are just solutioning. They do not talk about the problem and how to view the problem firstly. They start to write focusing on solving rather than talking well about the problem. You could ask the question: should you have done blogging instead of a newsletter? I know—to differentiate the way newsletters work and blogging works took time for me to understand. I thought why not blog in a newsletter way and you get a bunch of subscribers. Rather, it made me write what i do not want to write. The dashboard of the newsletter shows the subscription trends, who is reading. This metric is changing the way i write. Rather than focusing on my writing, i just focus on what i could say to convince users to subscribe. Is this what i want? no. Hence i decided to move to blogging site than newsletter.\u003c/p\u003e\n\u003ch2 id=\"blog-name-inspiration\"\u003eBlog Name Inspiration\u003c/h2\u003e\n\u003cp\u003eXenophane is a Greek philosopher who was the pioneer of first principle thinking. At the time of religion taking its peak, Xenophane thought about the clouds and rain from a non-religious base. In those times, religion was the answer for anything that is on earth. My blog writings will be based on first principles, questioning the assumptions that the theories are formed from.\u003c/p\u003e\n\u003cp\u003eXenophanes musings is a blog that captures the thoughts of a Xenophaner (any person who thinks from first principles).\u003c/p\u003e\n",
      "url": "http://localhost:1313/posts/new-beginning/",
      "date_published": "18056-18-09T545:1818:00+05:30",
      "date_modified": "18056-18-09T545:1818:00+05:30",
      "author": {
        "name": "Calvin Tran",
        "url": "http://localhost:1313/"
      }
    },
    
    {
      "id": "ed01e84ba19b1c5b8cada12f6f85828cfab9880b",
      "title": "Being Pragmatic",
      "summary": "",
      "content_text": "I was been a pragmatic guy when i started the cybersecurity journey. Pragmatic is doing things practically without any idea or principle behind it.\nBeing pragmatic is just doing and not thinking about how or why we are doing it, or not thinking about the method. A method is important as it shows the way to derive objective knowledge.\nKnowledge Creation To obtain knowledge, there are three ways: inductive reasoning, empirical observation, and scientific method.\nAn inductivist relies on their own self experiences and beliefs. They start to view the world from their inductivist lens. Experiences and beliefs presupposes patterns. Seeing the sun rise daily will make you believe that tomorrow the sun rises or it never dies. Relying on your patterns is the blind spot. It is similar to having one eye opened and the remaining eye closed.\nEmpirical observation is observing the real world through our human sensors such as eyes, mouth, ears. We believe what we see, what we speak, and what we hear. The problem with this approach is we never know all the information to decide on what is truth. Whatever we see, we speak, and we hear is just part of the truth. Without knowing the information, taking a decision or standing for what is right or wrong is not a better choice.\nScientific method is the trial and error elimination. To create a trial, you create hypothesis, and to eliminate error, you have to criticise the current theories and methodologies, and create a better one.\nBeing pragmatic follows inductive reasoning and empirical observation. Both inductive reasoning and empirical observation does not include error elimination i.e detecting errors and eliminating them by creating a new observation, basically it does not support criticising your own beliefs and trying to attain objective truth.\nBeing pragmatic is to have subjective opinions and it never helps in deriving objective truth.\nTo convert a subjective knowledge to objective knowledge is to form a method out of your subjective experiences and criticise on the latest methods and latest knowledge known. This is the reason why experiences will make you ignorant. For example, if you see security champion program did not work in your previous company, it does not mean that it will never work in other companies. This is a generalisation formed out of experiences and we should beware of those generalisation we make because this is not how world works. In a probability thinking, just because it did not worked once , it does not mean it will not work next time. Only absolute thinkers will generalise because it is easy to do so and caught up in their own judgements thereby not ready to fail again.\nBeing pragmatic is being attached to your experiences and what is right rather than not accepting objective right. It will become a problem as you cannot unlearn or deattach from your experiences. Being pragmatic can make you blind and stuck.\nWhy do we have to choose trial and error elimination over the other 2?\nOne of the major reasons is that by using the scientific method, we criticise the current set of theories and create a new set of theories, thereby advancing the domain or helping the human race to reach the next stage. It is crucial for our survival. For example, Natural selection theory by Charles Darwin refutes all the previous theory, especially Lamarck\u0026rsquo;s theory of evolution and we reach nearer to truth. We never achieve the truth rather we can get nearer to it. We can find ways to find errors and refute. we reach the stage of dogmatism if we think we achieved the truth.\n\u0026ldquo;All organisms, from the simplest to the most complex, learn by trial and error. But there is a profound difference in the way this method is applied.\nThe difference between the amoeba and Einstein is that, although both make use of the method of trial and error elimination, the amoeba dislikes erring while Einstein is intrigued by it. The amoeba, when it makes a mistake, dies or suffers; it has no interest in its errors except to avoid them. Einstein, on the other hand, is fascinated by his mistakes: he consciously searches for them, because he knows that we learn from our errors.\nThis conscious critical attitude, this readiness to learn from mistakes, is what distinguishes human knowledge from that of other animals, and it is what makes science possible.\u0026rdquo; \u0026ndash; Karl Popper\nDogmatism Relying on old theories because it works for you is dogmatism. Saying that “Gates, blocking, pentest methodology, waterfall testing, security review without a method” works are dogmatic approaches. Those old theories might work, it looks to you that it works. It is similar to war. War works. Winning a war also works practically, but it\u0026rsquo;s not the right method to do so. Hurting the person will eliminate the problem and it works practically, rather than managing the person. Some of the new theories are “iterative testing, Threat Modeling, Supply chain Security” which we start to focus on and start to implement.\nFuture is the past Most of the security vendors and influencers start to preach “Future is the past”. A company got breached due to a zero day vulnerability and hence you have to buy this product to protect you from these kinds of vulnerabilities. Security engineers try to convince the leadership to increase the budget/prioritise/invest in security efforts since some company got breached and it might happen to us. The problem with this approach is we never know.\nSecurity events are not the way to predict what is going to happen.\nFuture is conjecture - You cannot prove what is going to happen in the future. You cannot predict based on the past data, rather prepare for it.\nSecurity folks have to embrace that the future is conjecture, criticize dogmatic theories and advance security domains by forming new theories that refutes problems of old theories.\nThis blog post inspired from Karl Popper’s book “Objective Knowledge”\n",
      "content_html": "\u003cp\u003eI was been a pragmatic guy when i started the cybersecurity journey. Pragmatic is doing things practically without any idea or principle behind it.\u003c/p\u003e\n\u003cp\u003eBeing pragmatic is just doing and not thinking about how or why we are doing it, or not thinking about the method. A method is important as it shows the way to derive objective knowledge.\u003c/p\u003e\n\u003ch2 id=\"knowledge-creation\"\u003eKnowledge Creation\u003c/h2\u003e\n\u003cp\u003eTo obtain knowledge, there are three ways: inductive reasoning, empirical observation, and scientific method.\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e\n\u003cp\u003eAn inductivist relies on their own self experiences and beliefs. They start to view the world from their inductivist lens. Experiences and beliefs presupposes patterns. Seeing the sun rise daily will make you believe that tomorrow the sun rises or it never dies. Relying on your patterns is the blind spot. It is similar to having one eye opened and the remaining eye closed.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eEmpirical observation is observing the real world through our human sensors such as eyes, mouth, ears. We believe what we see, what we speak, and what we hear. The problem with this approach is we never know all the information to decide on what is truth. Whatever we see, we speak, and we hear is just part of the truth. Without knowing the information, taking a decision or standing for what is right or wrong is not a better choice.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eScientific method is the trial and error elimination. To create a trial, you create hypothesis, and to eliminate error, you have to criticise the current theories and methodologies, and create a better one.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eBeing pragmatic follows inductive reasoning and empirical observation. Both inductive reasoning and empirical observation does not include error elimination i.e detecting errors and eliminating them by creating a new observation, basically it does not support criticising your own beliefs and trying to attain objective truth.\u003c/p\u003e\n\u003cp\u003eBeing pragmatic is to have subjective opinions and it never helps in deriving objective truth.\u003c/p\u003e\n\u003cp\u003eTo convert a subjective knowledge to objective knowledge is to form a method out of your subjective experiences and criticise on the latest methods and latest knowledge known. This is the reason why experiences will make you ignorant. For example, if you see security champion program did not work in your previous company, it does not mean that it will never work in other companies. This is a generalisation formed out of experiences and we should beware of those generalisation we make because this is not how world works. In a probability thinking, just because it did not worked once , it does not mean it will not work next time. Only absolute thinkers will generalise because it is easy to do so and caught up in their own judgements thereby not ready to fail again.\u003c/p\u003e\n\u003cp\u003eBeing pragmatic is being attached to your experiences and what is right rather than not accepting objective right. It will become a problem as you cannot unlearn or deattach from your experiences. Being pragmatic can make you blind and stuck.\u003c/p\u003e\n\u003cp\u003eWhy do we have to choose trial and error elimination over the other 2?\u003c/p\u003e\n\u003cp\u003eOne of the major reasons is that by using the scientific method, we criticise the current set of theories and create a new set of theories, thereby advancing the domain or helping the human race to reach the next stage. It is crucial for our survival. For example, Natural selection theory by Charles Darwin refutes all the previous theory, especially Lamarck\u0026rsquo;s theory of evolution and we reach nearer to truth. We never achieve the truth rather we can get nearer to it. We can find ways to find errors and refute. we reach the stage of dogmatism if we think we achieved the truth.\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e\u0026ldquo;\u003cstrong\u003eAll organisms, from the simplest to the most complex, learn by trial and error. But there is a profound difference in the way this method is applied.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThe difference between the amoeba and Einstein is that, although both make use of the method of trial and error elimination, the amoeba dislikes erring while Einstein is intrigued by it. The amoeba, when it makes a mistake, dies or suffers; it has no interest in its errors except to avoid them. Einstein, on the other hand, is fascinated by his mistakes: he consciously searches for them, because he knows that we learn from our errors.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThis conscious critical attitude, this readiness to learn from mistakes, is what distinguishes human knowledge from that of other animals, and it is what makes science possible.\u003c/strong\u003e\u0026rdquo;\n\u0026ndash; Karl Popper\u003c/p\u003e\u003c/blockquote\u003e\n\u003ch2 id=\"dogmatism\"\u003eDogmatism\u003c/h2\u003e\n\u003cp\u003eRelying on old theories because it works for you is dogmatism. Saying that “Gates, blocking, pentest methodology, waterfall testing, security review without a method” works are dogmatic approaches. Those old theories might work, it looks to you that it works. It is similar to war. War works. Winning a war also works practically, but it\u0026rsquo;s not the right method to do so. Hurting the person will eliminate the problem and it works practically, rather than managing the person. Some of the new theories are “iterative testing, Threat Modeling, Supply chain Security” which we start to focus on and start to implement.\u003c/p\u003e\n\u003ch2 id=\"future-is-the-past\"\u003eFuture is the past\u003c/h2\u003e\n\u003cp\u003eMost of the security vendors and influencers start to preach “Future is the past”. A company got breached due to a zero day vulnerability and hence you have to buy this product to protect you from these kinds of vulnerabilities. Security engineers try to convince the leadership to increase the budget/prioritise/invest in security efforts since some company got breached and it might happen to us. The problem with this approach is we never know.\u003c/p\u003e\n\u003cp\u003eSecurity events are not the way to predict what is going to happen.\u003c/p\u003e\n\u003cp\u003eFuture is conjecture - You cannot prove what is going to happen in the future. You cannot predict based on the past data, rather prepare for it.\u003c/p\u003e\n\u003cp\u003eSecurity folks have to embrace that the future is conjecture, criticize dogmatic theories and advance security domains by forming new theories that refutes problems of old theories.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThis blog post inspired from Karl Popper’s book “Objective Knowledge”\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg\n  src=\"/images/being-pragmatic/karl_popper.avif\"\n  alt=\"Karl Popper Photo\"\n  loading=\"lazy\"\n  decoding=\"async\"\n  class=\"full-width\"\n/\u003e\n\n\u003c/p\u003e\n",
      "url": "http://localhost:1313/posts/being-pragmatic/",
      "date_published": "17056-17-09T526:1717:00+05:30",
      "date_modified": "17056-17-09T526:1717:00+05:30",
      "author": {
        "name": "Calvin Tran",
        "url": "http://localhost:1313/"
      }
    }
    
  ]
}