{
  "version": "https://jsonfeed.org/version/1",
  "title": "Xenophanes Musings",
  "home_page_url": "http://localhost:1313/",
  "feed_url": "http://localhost:1313/feed.json",
  "description": "A minimal hugo theme focus on content",
  "favicon": "http://localhost:1313//assets/favicon.ico",
  "expired": false,
  "author": {
    "name": "Calvin Tran",
    "url": "http://localhost:1313/"
  },
  "items": [
    
    

    
    {
      "id": "ea71eb1abc54cf9928a8365626f44efedd1f41e2",
      "title": "How Not to Be a Bad Engineer",
      "summary": "",
      "content_text": "Boss Pleasers Boss pleasers are individuals who work only for the boss. They do not take initiative on their own and wait for instructions before taking action. Once the boss assigns a task, they create a Jira ticket and start working.\nThe downside of boss pleasers is that they don’t listen to or collaborate with peers. They believe that simply pleasing or obeying the boss is sufficient for the pay they receive. They show little interest in improving themselves or being a guiding light for others. This mindset often hinders growth and teamwork.\nPrisoner\u0026rsquo;s Dilemma I was reminded of game theory in the context of corporate dynamics. Imagine a corporate event where two people are competing to be recognized and rewarded by the boss. Each person has two strategic choices: put in more effort or put in less effort.\nThe challenge is that these two individuals do not communicate with each other. They operate based on assumptions and have no clear information about what the other person will choose to do.\nThis creates a classic game theory scenario known as the Prisoner’s Dilemma. In this scenario, each person must decide their move independently and hope it leads to the best possible outcome for themselves.\nHowever, there is a personal cost involved. If putting in more effort significantly affects your work-life balance, you must ask yourself: is the potential reward worth it? Should you prioritize work or life?\nIn such uncertain situations, choosing less effort might be the smarter choice. This is because it helps protect your well-being, even if it means missing out on a reward.\nThe Prisoner’s Dilemma suggests that in competitive and uncertain environments, the rational strategy is often to choose less effort in order to safeguard your own interests. This is especially true when you do not know what the other person will do.\nHowever, the theory assumes that the cost of effort is the same for both people. In reality, that assumption rarely holds true.\nFor example, an unmarried person may find it easier to work long hours than someone who has family responsibilities. A married person with strong support systems or external help may also be able to manage more work without much disruption to their life. On the other hand, someone with caregiving duties or personal health concerns might find that extra effort comes at a high cost.\nThis means that the choice of how much effort to put in is not just strategic. It is deeply personal. It depends entirely on your individual work-life balance and what you are willing to trade off.\nIn the real world, there is no universal right move. The right choice is the one that aligns best with your life situation and personal values.\nBe the Boss “Be the boss” people are usually those with more experience who believe they already know how everything works. They tend to skip brainstorming and push their own ideas without seeking feedback.\nThey often fail to appreciate the efforts of others and dismiss suggestions from less experienced peers. Many people with over ten years of experience develop this ego-driven attitude. They often avoid feedback, ignore comments on their work, and act unapproachable. This behavior creates friction in collaborative environments.\nHeroes With Bad Ownership These are the heroes who collaborate well, work hard, and take initiative to lead their divisions, such as QA or Security. Because they invest a lot of effort, they start to take on ownership. But over time, this ownership can become unhealthy. They begin to feel personally responsible for everything and try to handle all the pressure themselves.\nOwnership is a great quality. However, it does not mean you have to own everything alone. Healthy teams share ownership. If you try to own too much and expect promotions every year because of that, it may not work out as expected.\nPromotions depend on several factors that are outside your control. These include the availability of the next level, budget allocations, the financial health of the company, and your manager’s perception and confidence in you. Understanding these factors helps you set realistic expectations.\nAvoid Boss Attitudes at All Cost Among all the types of behavior discussed above, boss attitudes—whether from boss pleasers or “be the boss” types—cause the most damage. These attitudes create toxic environments where others struggle to contribute and grow. The damage becomes even more severe when such behaviors are found in managers or architects. These roles require a high level of collaboration with individual contributors.\nPeople with boss attitudes often believe they are not the problem. It is like a tyrant who convinces themselves that they are acting in the best interest of others, when in reality, they are simply trying to stay in control.\nHow to Be a Good Engineer Collaborate well with your peers. Make others feel good about working with you. Be the go-to SPOC for your division, but be open to sharing that role with others. Appreciate others often. Even a simple “thank you” can make a big difference. Communicate your concerns early and clearly with your manager. Do not wait for your manager to start the conversation. Even if things don’t go your way, do not lose your core values or identity. Avoid boss attitudes. Accept feedback from less experienced engineers and genuinely listen. Don’t assume your way is always the right way. Allow failure and learning to happen. Avoid being so overprotective of your division that it creates fear in others. ",
      "content_html": "\u003ch2 id=\"boss-pleasers\"\u003eBoss Pleasers\u003c/h2\u003e\n\u003cp\u003eBoss pleasers are individuals who work only for the boss. They do not take initiative on their own and wait for instructions before taking action. Once the boss assigns a task, they create a Jira ticket and start working.\u003c/p\u003e\n\u003cp\u003eThe downside of boss pleasers is that they don’t listen to or collaborate with peers. They believe that simply pleasing or obeying the boss is sufficient for the pay they receive. They show little interest in improving themselves or being a guiding light for others. This mindset often hinders growth and teamwork.\u003c/p\u003e\n\u003ch2 id=\"prisoners-dilemma\"\u003ePrisoner\u0026rsquo;s Dilemma\u003c/h2\u003e\n\u003cp\u003eI was reminded of game theory in the context of corporate dynamics. Imagine a corporate event where two people are competing to be recognized and rewarded by the boss. Each person has two strategic choices: put in more effort or put in less effort.\u003c/p\u003e\n\u003cp\u003eThe challenge is that these two individuals do not communicate with each other. They operate based on assumptions and have no clear information about what the other person will choose to do.\u003c/p\u003e\n\u003cp\u003eThis creates a classic game theory scenario known as the Prisoner’s Dilemma. In this scenario, each person must decide their move independently and hope it leads to the best possible outcome for themselves.\u003c/p\u003e\n\u003cp\u003eHowever, there is a personal cost involved. If putting in more effort significantly affects your work-life balance, you must ask yourself: is the potential reward worth it? Should you prioritize work or life?\u003c/p\u003e\n\u003cp\u003eIn such uncertain situations, choosing less effort might be the smarter choice. This is because it helps protect your well-being, even if it means missing out on a reward.\u003c/p\u003e\n\u003cp\u003e\u003cimg\n  src=\"/images/types-of-peers/gametheory.png\"\n  alt=\"Game Theory\"\n  loading=\"lazy\"\n  decoding=\"async\"\n  class=\"full-width\"\n/\u003e\n\n\u003c/p\u003e\n\u003cp\u003eThe Prisoner’s Dilemma suggests that in competitive and uncertain environments, the rational strategy is often to choose less effort in order to safeguard your own interests. This is especially true when you do not know what the other person will do.\u003c/p\u003e\n\u003cp\u003eHowever, the theory assumes that the cost of effort is the same for both people. In reality, that assumption rarely holds true.\u003c/p\u003e\n\u003cp\u003eFor example, an unmarried person may find it easier to work long hours than someone who has family responsibilities. A married person with strong support systems or external help may also be able to manage more work without much disruption to their life. On the other hand, someone with caregiving duties or personal health concerns might find that extra effort comes at a high cost.\u003c/p\u003e\n\u003cp\u003eThis means that the choice of how much effort to put in is not just strategic. It is deeply personal. It depends entirely on your individual work-life balance and what you are willing to trade off.\u003c/p\u003e\n\u003cp\u003eIn the real world, there is no universal right move. The right choice is the one that aligns best with your life situation and personal values.\u003c/p\u003e\n\u003ch2 id=\"be-the-boss\"\u003eBe the Boss\u003c/h2\u003e\n\u003cp\u003e“Be the boss” people are usually those with more experience who believe they already know how everything works. They tend to skip brainstorming and push their own ideas without seeking feedback.\u003c/p\u003e\n\u003cp\u003eThey often fail to appreciate the efforts of others and dismiss suggestions from less experienced peers. Many people with over ten years of experience develop this ego-driven attitude. They often avoid feedback, ignore comments on their work, and act unapproachable. This behavior creates friction in collaborative environments.\u003c/p\u003e\n\u003ch2 id=\"heroes-with-bad-ownership\"\u003eHeroes With Bad Ownership\u003c/h2\u003e\n\u003cp\u003eThese are the heroes who collaborate well, work hard, and take initiative to lead their divisions, such as QA or Security. Because they invest a lot of effort, they start to take on ownership. But over time, this ownership can become unhealthy. They begin to feel personally responsible for everything and try to handle all the pressure themselves.\u003c/p\u003e\n\u003cp\u003eOwnership is a great quality. However, it does not mean you have to own everything alone. Healthy teams share ownership. If you try to own too much and expect promotions every year because of that, it may not work out as expected.\u003c/p\u003e\n\u003cp\u003ePromotions depend on several factors that are outside your control. These include the availability of the next level, budget allocations, the financial health of the company, and your manager’s perception and confidence in you. Understanding these factors helps you set realistic expectations.\u003c/p\u003e\n\u003ch2 id=\"avoid-boss-attitudes-at-all-cost\"\u003eAvoid Boss Attitudes at All Cost\u003c/h2\u003e\n\u003cp\u003eAmong all the types of behavior discussed above, boss attitudes—whether from boss pleasers or “be the boss” types—cause the most damage. These attitudes create toxic environments where others struggle to contribute and grow. The damage becomes even more severe when such behaviors are found in managers or architects. These roles require a high level of collaboration with individual contributors.\u003c/p\u003e\n\u003cp\u003ePeople with boss attitudes often believe they are not the problem. It is like a tyrant who convinces themselves that they are acting in the best interest of others, when in reality, they are simply trying to stay in control.\u003c/p\u003e\n\u003ch2 id=\"how-to-be-a-good-engineer\"\u003eHow to Be a Good Engineer\u003c/h2\u003e\n\u003col\u003e\n\u003cli\u003eCollaborate well with your peers.\u003c/li\u003e\n\u003cli\u003eMake others feel good about working with you.\u003c/li\u003e\n\u003cli\u003eBe the go-to SPOC for your division, but be open to sharing that role with others.\u003c/li\u003e\n\u003cli\u003eAppreciate others often. Even a simple “thank you” can make a big difference.\u003c/li\u003e\n\u003cli\u003eCommunicate your concerns early and clearly with your manager. Do not wait for your manager to start the conversation.\u003c/li\u003e\n\u003cli\u003eEven if things don’t go your way, do not lose your core values or identity.\u003c/li\u003e\n\u003cli\u003eAvoid boss attitudes. Accept feedback from less experienced engineers and genuinely listen. Don’t assume your way is always the right way. Allow failure and learning to happen. Avoid being so overprotective of your division that it creates fear in others.\u003c/li\u003e\n\u003c/ol\u003e\n",
      "url": "http://localhost:1313/posts/types-of-peers/",
      "date_published": "21056-21-09T540:2121:00+05:30",
      "date_modified": "21056-21-09T540:2121:00+05:30",
      "author": {
        "name": "Calvin Tran",
        "url": "http://localhost:1313/"
      }
    },
    
    {
      "id": "b7c79b7baf65233a4adaabec8486f30fb5866a10",
      "title": "New Beginning",
      "summary": "",
      "content_text": "Beginning of Xenophanes musings I am restarting my old way of blogging with more quantity, with the right quality efforts. i have decided to move all my writings from my beehiiv newsletter to a personal blogging site.\nMy journey of writing: Looking back, I started to write from the year 2020 with Hugo static site generator hosted in Netlify. https://pwnl0rd.netlify.app/ I was not a consistent writer back then and i used to tinker with computer systems. Now i am a theorist, i think before i do, i ask questions against the assumptions that are held. As a habit, i read books for 30 mins daily and i write connecting between security and the book i read. From late 2023, i consistently started to write one blog post per month. Now, I want to do more. I have decided to write more and write when i want to write.\nRunning a newsletter Writing a newsletter is different from writing a blog. I do not have a good experience with Substack because Substack will block you if anyone reports you as spam. Then i migrated to beehiiv (https://ram.beehiiv.com/). Substack had good distribution provided by the platform but was controlled, whereas beehiiv does not have good distribution so i have to distribute by myself. In the newsletter, by default readers think that the writer expects them to subscribe. This makes them judge who am i rather than what i write. I do not care about me at all, who am i. I care about my writings and the expectations to be read by people. I do not want to write for the sake of free subs which does not do any good to me. I want to entirely let go of this newsletter way of blogging and come to a simple blog. If anyone wants to follow my blogs, they could by following the RSS feed and not by force or begging to follow mine cause their time is precious. There are so many writings, blog posts already there. I do not want to create noise. Rather, i will use this blog post to write what all i think and be a better writer rather than a salesman convincing people to subscribe to it. Another reason would be that readers are distracted in the newsletter by popups, fancy pages and it forces me to write in a style which i do not want to do.\nTo run a newsletter, I should either write for a market/readers who are looking for my next post. Personally, i do not want to run a newsletter cause it is noise rather than signal or i need user subscriptions such that in the future they are going to help me by monetizing it.\nTo run a newsletter, you need to write a post per week to keep the users on the hook. i did try weekly reads, a curated list of links in product security. i did it for a few weeks and then the question i had is, should i change my newsletter to weekly reads. That does not quench my satisfaction. I do not want to treat my writings as a newsletter cause i am a blogger.\nIf you could ask me about the best blogs/writings, i would say Irrational Exuberance, Manas J Saloi blogs. These are golden writings and journal-style blogging. I liked journal blogs. It is transparent, honest, no gimmicks of solutioning, it is what it is. I believe most of the newsletters i read in cybersecurity are just solutioning. They do not talk about the problem and how to view the problem firstly. They start to write focusing on solving rather than talking well about the problem. You could ask the question: should you have done blogging instead of a newsletter? I know—to differentiate the way newsletters work and blogging works took time for me to understand. I thought why not blog in a newsletter way and you get a bunch of subscribers. Rather, it made me write what i do not want to write. The dashboard of the newsletter shows the subscription trends, who is reading. This metric is changing the way i write. Rather than focusing on my writing, i just focus on what i could say to convince users to subscribe. Is this what i want? no. Hence i decided to move to blogging site than newsletter.\nBlog Name Inspiration Xenophane is a Greek philosopher who was the pioneer of first principle thinking. At the time of religion taking its peak, Xenophane thought about the clouds and rain from a non-religious base. In those times, religion was the answer for anything that is on earth. My blog writings will be based on first principles, questioning the assumptions that the theories are formed from.\nXenophanes musings is a blog that captures the thoughts of a Xenophaner (any person who thinks from first principles).\n",
      "content_html": "\u003ch1 id=\"beginning-of-xenophanes-musings\"\u003eBeginning of Xenophanes musings\u003c/h1\u003e\n\u003cp\u003eI am restarting my old way of blogging with more quantity, with the right quality efforts. i have decided to move all my writings from my beehiiv newsletter to a personal blogging site.\u003c/p\u003e\n\u003ch2 id=\"my-journey-of-writing\"\u003eMy journey of writing:\u003c/h2\u003e\n\u003cp\u003eLooking back, I started to write from the year 2020 with Hugo static site generator hosted in Netlify. \u003ca href=\"https://pwnl0rd.netlify.app/\"\u003ehttps://pwnl0rd.netlify.app/\u003c/a\u003e I was not a consistent writer back then and i used to tinker with computer systems. Now i am a theorist, i think before i do, i ask questions against the assumptions that are held. As a habit, i read books for 30 mins daily and i write connecting between security and the book i read. From late 2023, i consistently started to write one blog post per month. Now, I want to do more. I have decided to write more and write when i want to write.\u003c/p\u003e\n\u003ch2 id=\"running-a-newsletter\"\u003eRunning a newsletter\u003c/h2\u003e\n\u003cp\u003eWriting a newsletter is different from writing a blog. I do not have a good experience with Substack because Substack will block you if anyone reports you as spam. Then i migrated to beehiiv (\u003ca href=\"https://ram.beehiiv.com/)\"\u003ehttps://ram.beehiiv.com/)\u003c/a\u003e. Substack had good distribution provided by the platform but was controlled, whereas beehiiv does not have good distribution so i have to distribute by myself. In the newsletter, by default readers think that the writer expects them to subscribe. This makes them judge who am i rather than what i write. I do not care about me at all, who am i. I care about my writings and the expectations to be read by people. I do not want to write for the sake of free subs which does not do any good to me. I want to entirely let go of this newsletter way of blogging and come to a simple blog. If anyone wants to follow my blogs, they could by following the RSS feed and not by force or begging to follow mine cause their time is precious. There are so many writings, blog posts already there. I do not want to create noise. Rather, i will use this blog post to write what all i think and be a better writer rather than a salesman convincing people to subscribe to it. Another reason would be that readers are distracted in the newsletter by popups, fancy pages and it forces me to write in a style which i do not want to do.\u003c/p\u003e\n\u003cp\u003eTo run a newsletter, I should either write for a market/readers who are looking for my next post. Personally, i do not want to run a newsletter cause it is noise rather than signal or i need user subscriptions such that in the future they are going to help me by monetizing it.\u003c/p\u003e\n\u003cp\u003eTo run a newsletter, you need to write a post per week to keep the users on the hook. i did try weekly reads, a curated list of links in product security. i did it for a few weeks and then the question i had is, should i change my newsletter to weekly reads. That does not quench my satisfaction. I do not want to treat my writings as a newsletter cause i am a blogger.\u003c/p\u003e\n\u003cp\u003eIf you could ask me about the best blogs/writings, i would say Irrational Exuberance, Manas J Saloi blogs. These are golden writings and journal-style blogging. I liked journal blogs. It is transparent, honest, no gimmicks of solutioning, it is what it is. I believe most of the newsletters i read in cybersecurity are just solutioning. They do not talk about the problem and how to view the problem firstly. They start to write focusing on solving rather than talking well about the problem. You could ask the question: should you have done blogging instead of a newsletter? I know—to differentiate the way newsletters work and blogging works took time for me to understand. I thought why not blog in a newsletter way and you get a bunch of subscribers. Rather, it made me write what i do not want to write. The dashboard of the newsletter shows the subscription trends, who is reading. This metric is changing the way i write. Rather than focusing on my writing, i just focus on what i could say to convince users to subscribe. Is this what i want? no. Hence i decided to move to blogging site than newsletter.\u003c/p\u003e\n\u003ch2 id=\"blog-name-inspiration\"\u003eBlog Name Inspiration\u003c/h2\u003e\n\u003cp\u003eXenophane is a Greek philosopher who was the pioneer of first principle thinking. At the time of religion taking its peak, Xenophane thought about the clouds and rain from a non-religious base. In those times, religion was the answer for anything that is on earth. My blog writings will be based on first principles, questioning the assumptions that the theories are formed from.\u003c/p\u003e\n\u003cp\u003eXenophanes musings is a blog that captures the thoughts of a Xenophaner (any person who thinks from first principles).\u003c/p\u003e\n",
      "url": "http://localhost:1313/posts/new-beginning/",
      "date_published": "18056-18-09T545:1818:00+05:30",
      "date_modified": "18056-18-09T545:1818:00+05:30",
      "author": {
        "name": "Calvin Tran",
        "url": "http://localhost:1313/"
      }
    },
    
    {
      "id": "ed01e84ba19b1c5b8cada12f6f85828cfab9880b",
      "title": "Being Pragmatic",
      "summary": "",
      "content_text": "I was been a pragmatic guy when i started the cybersecurity journey. Pragmatic is doing things practically without any idea or principle behind it.\nBeing pragmatic is just doing and not thinking about how or why we are doing it, or not thinking about the method. A method is important as it shows the way to derive objective knowledge.\nKnowledge Creation To obtain knowledge, there are three ways: inductive reasoning, empirical observation, and scientific method.\nAn inductivist relies on their own self experiences and beliefs. They start to view the world from their inductivist lens. Experiences and beliefs presupposes patterns. Seeing the sun rise daily will make you believe that tomorrow the sun rises or it never dies. Relying on your patterns is the blind spot. It is similar to having one eye opened and the remaining eye closed.\nEmpirical observation is observing the real world through our human sensors such as eyes, mouth, ears. We believe what we see, what we speak, and what we hear. The problem with this approach is we never know all the information to decide on what is truth. Whatever we see, we speak, and we hear is just part of the truth. Without knowing the information, taking a decision or standing for what is right or wrong is not a better choice.\nScientific method is the trial and error elimination. To create a trial, you create hypothesis, and to eliminate error, you have to criticise the current theories and methodologies, and create a better one.\nBeing pragmatic follows inductive reasoning and empirical observation. Both inductive reasoning and empirical observation does not include error elimination i.e detecting errors and eliminating them by creating a new observation, basically it does not support criticising your own beliefs and trying to attain objective truth.\nBeing pragmatic is to have subjective opinions and it never helps in deriving objective truth.\nTo convert a subjective knowledge to objective knowledge is to form a method out of your subjective experiences and criticise on the latest methods and latest knowledge known. This is the reason why experiences will make you ignorant. For example, if you see security champion program did not work in your previous company, it does not mean that it will never work in other companies. This is a generalisation formed out of experiences and we should beware of those generalisation we make because this is not how world works. In a probability thinking, just because it did not worked once , it does not mean it will not work next time. Only absolute thinkers will generalise because it is easy to do so and caught up in their own judgements thereby not ready to fail again.\nBeing pragmatic is being attached to your experiences and what is right rather than not accepting objective right. It will become a problem as you cannot unlearn or deattach from your experiences. Being pragmatic can make you blind and stuck.\nWhy do we have to choose trial and error elimination over the other 2?\nOne of the major reasons is that by using the scientific method, we criticise the current set of theories and create a new set of theories, thereby advancing the domain or helping the human race to reach the next stage. It is crucial for our survival. For example, Natural selection theory by Charles Darwin refutes all the previous theory, especially Lamarck\u0026rsquo;s theory of evolution and we reach nearer to truth. We never achieve the truth rather we can get nearer to it. We can find ways to find errors and refute. we reach the stage of dogmatism if we think we achieved the truth.\n\u0026ldquo;All organisms, from the simplest to the most complex, learn by trial and error. But there is a profound difference in the way this method is applied.\nThe difference between the amoeba and Einstein is that, although both make use of the method of trial and error elimination, the amoeba dislikes erring while Einstein is intrigued by it. The amoeba, when it makes a mistake, dies or suffers; it has no interest in its errors except to avoid them. Einstein, on the other hand, is fascinated by his mistakes: he consciously searches for them, because he knows that we learn from our errors.\nThis conscious critical attitude, this readiness to learn from mistakes, is what distinguishes human knowledge from that of other animals, and it is what makes science possible.\u0026rdquo; \u0026ndash; Karl Popper\nDogmatism Relying on old theories because it works for you is dogmatism. Saying that “Gates, blocking, pentest methodology, waterfall testing, security review without a method” works are dogmatic approaches. Those old theories might work, it looks to you that it works. It is similar to war. War works. Winning a war also works practically, but it\u0026rsquo;s not the right method to do so. Hurting the person will eliminate the problem and it works practically, rather than managing the person. Some of the new theories are “iterative testing, Threat Modeling, Supply chain Security” which we start to focus on and start to implement.\nFuture is the past Most of the security vendors and influencers start to preach “Future is the past”. A company got breached due to a zero day vulnerability and hence you have to buy this product to protect you from these kinds of vulnerabilities. Security engineers try to convince the leadership to increase the budget/prioritise/invest in security efforts since some company got breached and it might happen to us. The problem with this approach is we never know.\nSecurity events are not the way to predict what is going to happen.\nFuture is conjecture - You cannot prove what is going to happen in the future. You cannot predict based on the past data, rather prepare for it.\nSecurity folks have to embrace that the future is conjecture, criticize dogmatic theories and advance security domains by forming new theories that refutes problems of old theories.\nThis blog post inspired from Karl Popper’s book “Objective Knowledge”\n",
      "content_html": "\u003cp\u003eI was been a pragmatic guy when i started the cybersecurity journey. Pragmatic is doing things practically without any idea or principle behind it.\u003c/p\u003e\n\u003cp\u003eBeing pragmatic is just doing and not thinking about how or why we are doing it, or not thinking about the method. A method is important as it shows the way to derive objective knowledge.\u003c/p\u003e\n\u003ch2 id=\"knowledge-creation\"\u003eKnowledge Creation\u003c/h2\u003e\n\u003cp\u003eTo obtain knowledge, there are three ways: inductive reasoning, empirical observation, and scientific method.\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e\n\u003cp\u003eAn inductivist relies on their own self experiences and beliefs. They start to view the world from their inductivist lens. Experiences and beliefs presupposes patterns. Seeing the sun rise daily will make you believe that tomorrow the sun rises or it never dies. Relying on your patterns is the blind spot. It is similar to having one eye opened and the remaining eye closed.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eEmpirical observation is observing the real world through our human sensors such as eyes, mouth, ears. We believe what we see, what we speak, and what we hear. The problem with this approach is we never know all the information to decide on what is truth. Whatever we see, we speak, and we hear is just part of the truth. Without knowing the information, taking a decision or standing for what is right or wrong is not a better choice.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eScientific method is the trial and error elimination. To create a trial, you create hypothesis, and to eliminate error, you have to criticise the current theories and methodologies, and create a better one.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eBeing pragmatic follows inductive reasoning and empirical observation. Both inductive reasoning and empirical observation does not include error elimination i.e detecting errors and eliminating them by creating a new observation, basically it does not support criticising your own beliefs and trying to attain objective truth.\u003c/p\u003e\n\u003cp\u003eBeing pragmatic is to have subjective opinions and it never helps in deriving objective truth.\u003c/p\u003e\n\u003cp\u003eTo convert a subjective knowledge to objective knowledge is to form a method out of your subjective experiences and criticise on the latest methods and latest knowledge known. This is the reason why experiences will make you ignorant. For example, if you see security champion program did not work in your previous company, it does not mean that it will never work in other companies. This is a generalisation formed out of experiences and we should beware of those generalisation we make because this is not how world works. In a probability thinking, just because it did not worked once , it does not mean it will not work next time. Only absolute thinkers will generalise because it is easy to do so and caught up in their own judgements thereby not ready to fail again.\u003c/p\u003e\n\u003cp\u003eBeing pragmatic is being attached to your experiences and what is right rather than not accepting objective right. It will become a problem as you cannot unlearn or deattach from your experiences. Being pragmatic can make you blind and stuck.\u003c/p\u003e\n\u003cp\u003eWhy do we have to choose trial and error elimination over the other 2?\u003c/p\u003e\n\u003cp\u003eOne of the major reasons is that by using the scientific method, we criticise the current set of theories and create a new set of theories, thereby advancing the domain or helping the human race to reach the next stage. It is crucial for our survival. For example, Natural selection theory by Charles Darwin refutes all the previous theory, especially Lamarck\u0026rsquo;s theory of evolution and we reach nearer to truth. We never achieve the truth rather we can get nearer to it. We can find ways to find errors and refute. we reach the stage of dogmatism if we think we achieved the truth.\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003e\u0026ldquo;\u003cstrong\u003eAll organisms, from the simplest to the most complex, learn by trial and error. But there is a profound difference in the way this method is applied.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThe difference between the amoeba and Einstein is that, although both make use of the method of trial and error elimination, the amoeba dislikes erring while Einstein is intrigued by it. The amoeba, when it makes a mistake, dies or suffers; it has no interest in its errors except to avoid them. Einstein, on the other hand, is fascinated by his mistakes: he consciously searches for them, because he knows that we learn from our errors.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThis conscious critical attitude, this readiness to learn from mistakes, is what distinguishes human knowledge from that of other animals, and it is what makes science possible.\u003c/strong\u003e\u0026rdquo;\n\u0026ndash; Karl Popper\u003c/p\u003e\u003c/blockquote\u003e\n\u003ch2 id=\"dogmatism\"\u003eDogmatism\u003c/h2\u003e\n\u003cp\u003eRelying on old theories because it works for you is dogmatism. Saying that “Gates, blocking, pentest methodology, waterfall testing, security review without a method” works are dogmatic approaches. Those old theories might work, it looks to you that it works. It is similar to war. War works. Winning a war also works practically, but it\u0026rsquo;s not the right method to do so. Hurting the person will eliminate the problem and it works practically, rather than managing the person. Some of the new theories are “iterative testing, Threat Modeling, Supply chain Security” which we start to focus on and start to implement.\u003c/p\u003e\n\u003ch2 id=\"future-is-the-past\"\u003eFuture is the past\u003c/h2\u003e\n\u003cp\u003eMost of the security vendors and influencers start to preach “Future is the past”. A company got breached due to a zero day vulnerability and hence you have to buy this product to protect you from these kinds of vulnerabilities. Security engineers try to convince the leadership to increase the budget/prioritise/invest in security efforts since some company got breached and it might happen to us. The problem with this approach is we never know.\u003c/p\u003e\n\u003cp\u003eSecurity events are not the way to predict what is going to happen.\u003c/p\u003e\n\u003cp\u003eFuture is conjecture - You cannot prove what is going to happen in the future. You cannot predict based on the past data, rather prepare for it.\u003c/p\u003e\n\u003cp\u003eSecurity folks have to embrace that the future is conjecture, criticize dogmatic theories and advance security domains by forming new theories that refutes problems of old theories.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThis blog post inspired from Karl Popper’s book “Objective Knowledge”\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cimg\n  src=\"/images/being-pragmatic/karl_popper.avif\"\n  alt=\"Karl Popper Photo\"\n  loading=\"lazy\"\n  decoding=\"async\"\n  class=\"full-width\"\n/\u003e\n\n\u003c/p\u003e\n",
      "url": "http://localhost:1313/posts/being-pragmatic/",
      "date_published": "17056-17-09T526:1717:00+05:30",
      "date_modified": "17056-17-09T526:1717:00+05:30",
      "author": {
        "name": "Calvin Tran",
        "url": "http://localhost:1313/"
      }
    }
    
  ]
}